results/routeA/initialization_check/A-Ra1e4-coarse/0/T
FoamFile
{
    format ascii;
    class volScalarField;
    object T;
}
dimensions [0 0 0 1 0 0 0];
internalField uniform 300;
boundaryField
{
    hotWall    { type fixedValue; value uniform 300.5; }
    coldWall   { type fixedValue; value uniform 299.5; }
    bottomWall { type zeroGradient; }
    topWall    { type zeroGradient; }
    front      { type empty; }
    back       { type empty; }
}
