results/routeA/initialization_check/A-Ra1e4-coarse/0/gh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1600
(
-0.00176056338028169
-0.00176056338028169
-0.00176056338028169
-0.00176056338028169
-0.00176056338028169
-0.00176056338028169
-0.00176056338028169
-0.001760563380281691
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.00176056338028169
-0.005281690140845071
-0.008802816901408451
-0.01232394366197183
-0.01584507042253521
-0.01936619718309859
-0.02288732394366197
-0.02640845070422535
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.00176056338028169
-0.005281690140845071
-0.008802816901408451
-0.01232394366197183
-0.01584507042253521
-0.01936619718309859
-0.02288732394366197
-0.02640845070422535
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.1408450704225352
-0.1408450704225352
-0.1408450704225352
-0.1408450704225352
-0.1408450704225352
-0.1408450704225352
-0.1408450704225352
-0.1408450704225352
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
