results/routeA/initialization_check/A-Ra1e4-coarse/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1600
(
-0.00176056338028169
-0.00176056338028169
-0.00176056338028169
-0.00176056338028169
-0.00176056338028169
-0.00176056338028169
-0.00176056338028169
-0.00176056338028169
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.001759683098591549
-0.005279049295774648
-0.008798415492957746
-0.01231778169014085
-0.01583714788732394
-0.01935651408450704
-0.02287588028169014
-0.02639524647887324
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.001761443661971831
-0.005284330985915493
-0.008807218309859154
-0.01233010563380282
-0.01585299295774648
-0.01937588028169014
-0.0228987676056338
-0.02642165492957747
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           uniform -0.1408450704225352;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
